## Demostración de Pandas

In [8]:
lista = [0,1,2,3,4,5,6,7]

In [2]:
lista2 = ["Save","the","Pandas"]

In [4]:
lista[0]

1

In [10]:
lista[2:5]

[2, 3, 4]

In [11]:
for element in lista:
    print element

0
1
2
3
4
5
6
7

In [12]:
for cadena in lista2:
    print cadena

Save
the
Pandas

In [13]:
len(lista2)

3

In [14]:
range(0,len(lista2))

[0, 1, 2]

In [15]:
for position in range(0,len(lista2)):
    print lista2[position]

Save
the
Pandas

In [16]:
for element in enumerate(lista2):
   print element

(0, 'Save')
(1, 'the')
(2, 'Pandas')

In [17]:
for i, element in enumerate(lista2):
    print i
    print element

0
Save
1
the
2
Pandas

In [305]:
[2*number+1 for number in lista]

[1, 3, 5, 7, 9, 11, 13, 15]

### Diccionarios

In [20]:
dic={"hello":1,3:"guays"}

In [21]:
dic[3]

'guays'

In [22]:
for key in dic:
    print key

3
hello

In [23]:
for key in dic:
    print dic[key]

guays
1

## Numpy

In [24]:
import numpy as np

In [26]:
lista5 = [1,2,3,4,5]

In [27]:
array1 = np.array(lista5)

In [28]:
array1+1

array([2, 3, 4, 5, 6])

In [29]:
array2=np.array(lista5)

In [30]:
array1+array2

array([ 2,  4,  6,  8, 10])

In [31]:
%time print "hello"

hello
CPU times: user 26 µs, sys: 9 µs, total: 35 µs
Wall time: 37.2 µs

In [33]:
listamillon = range(0,1000000)

In [35]:
%time newlist=[number+1 for number in listamillon]

CPU times: user 62.7 ms, sys: 21.8 ms, total: 84.5 ms
Wall time: 94.9 ms

In [36]:
arraymillon = np.arange(1000000)

In [38]:
%time newarray = arraymillon+1

CPU times: user 1 ms, sys: 3.81 ms, total: 4.81 ms
Wall time: 5.63 ms

## Pandas Series!!!

In [39]:
import pandas as pd

In [40]:
from pandas import Series

In [44]:
lista2

['Save', 'the', 'Pandas']

In [41]:
serie1 = Series(lista2)

In [43]:
serie1

0      Save
1       the
2    Pandas
dtype: object

In [45]:
serie2 = Series(lista2, index=[5,6,7])

In [47]:
serie2

5      Save
6       the
7    Pandas
dtype: object

In [48]:
serie2.index

Int64Index([5, 6, 7], dtype='int64')

In [49]:
serie2.values

array(['Save', 'the', 'Pandas'], dtype=object)

In [50]:
serie3 = Series(lista2,index=["element1","element2","element3"])

In [51]:
serie3

element1      Save
element2       the
element3    Pandas
dtype: object

In [60]:
lista3 = range(1,9)

In [61]:
lista3

[1, 2, 3, 4, 5, 6, 7, 8]

In [55]:
serie4 = Series(lista3)

In [56]:
serie4

0      1
1      2
2      3
3      4
4      5
5      6
6      7
7      8
8      9
9     10
10    11
11    12
12    13
13    14
14    15
dtype: int64

In [57]:
serie4+serie4

0      2
1      4
2      6
3      8
4     10
5     12
6     14
7     16
8     18
9     20
10    22
11    24
12    26
13    28
14    30
dtype: int64

In [62]:
serie5 = Series(lista3,index=[1,2,3,4,5,6,7,8])

In [63]:
serie5

1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
dtype: int64

In [64]:
serie5[7]

7

In [66]:
serie4+serie5

0    NaN
1      3
2      5
3      7
4      9
5     11
6     13
7     15
8     17
9    NaN
10   NaN
11   NaN
12   NaN
13   NaN
14   NaN
dtype: float64

## Pandas DataFrame

In [68]:
from pandas import DataFrame

In [70]:
serie6 = 2*serie4

In [71]:
serie6

0      2
1      4
2      6
3      8
4     10
5     12
6     14
7     16
8     18
9     20
10    22
11    24
12    26
13    28
14    30
dtype: int64

In [261]:
dataframe1=DataFrame([serie4,serie6])

In [262]:
dataframe1

   0   1   2   3   4   5   6   7   8   9   10  11  12  13  14
0   1   2   3   4   5   6   7   8   9  10  11  12  13  14  15
1   2   4   6   8  10  12  14  16  18  20  22  24  26  28  30

In [264]:
dataframe1 = DataFrame({'col1':serie4,'col2':serie6})

In [265]:
dataframe1

    col1  col2
0      1     2
1      2     4
2      3     6
3      4     8
4      5    10
5      6    12
6      7    14
7      8    16
8      9    18
9     10    20
10    11    22
11    12    24
12    13    26
13    14    28
14    15    30

In [266]:
dataframe1.columns

Index([u'col1', u'col2'], dtype='object')

In [267]:
dataframe1.index

Int64Index([0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14], dtype='int64')

In [268]:
dataframe1["col1"]

0      1
1      2
2      3
3      4
4      5
5      6
6      7
7      8
8      9
9     10
10    11
11    12
12    13
13    14
14    15
Name: col1, dtype: int64

In [269]:
dataframe2 = DataFrame({"col1":[1,2,3],"col2":["Save","the","Pandas"]})

In [270]:
dataframe2

   col1    col2
0     1    Save
1     2     the
2     3  Pandas

In [271]:
dataframe2["col2"]

0      Save
1       the
2    Pandas
Name: col2, dtype: object

In [272]:
dataframe2["col2"][0]

'Save'

In [273]:
dataframe1

    col1  col2
0      1     2
1      2     4
2      3     6
3      4     8
4      5    10
5      6    12
6      7    14
7      8    16
8      9    18
9     10    20
10    11    22
11    12    24
12    13    26
13    14    28
14    15    30

In [274]:
dataframe1["col3"]=1

In [275]:
dataframe1

    col1  col2  col3
0      1     2     1
1      2     4     1
2      3     6     1
3      4     8     1
4      5    10     1
5      6    12     1
6      7    14     1
7      8    16     1
8      9    18     1
9     10    20     1
10    11    22     1
11    12    24     1
12    13    26     1
13    14    28     1
14    15    30     1

In [276]:
dataframe1["col5"]=np.arange(15)

In [277]:
dataframe1

    col1  col2  col3  col5
0      1     2     1     0
1      2     4     1     1
2      3     6     1     2
3      4     8     1     3
4      5    10     1     4
5      6    12     1     5
6      7    14     1     6
7      8    16     1     7
8      9    18     1     8
9     10    20     1     9
10    11    22     1    10
11    12    24     1    11
12    13    26     1    12
13    14    28     1    13
14    15    30     1    14

### Limpieza de valores

In [96]:
np.nan

nan

In [284]:
array100 = np.array([1,2,3,np.nan])

In [285]:
dataframe3 = DataFrame(array100)

In [286]:
dataframe3

    0
0   1
1   2
2   3
3 NaN

In [287]:
dataframe3.dropna()

   0
0  1
1  2
2  3

In [288]:
dataframe3.T

   0  1  2   3
0  1  2  3 NaN

In [289]:
dataframe3.T.dropna()

Empty DataFrame
Columns: [0, 1, 2, 3]
Index: []

In [290]:
dataframe3[0]

0     1
1     2
2     3
3   NaN
Name: 0, dtype: float64

In [291]:
dataframe3[0][2] = 6

In [107]:
dataframe3

    0
0   1
1   2
2   6
3 NaN

In [108]:
dataframe1

    col1  col2  col3  col5
0      1     2     1     0
1      2     4     1     1
2      3     6     1     2
3      4     8     1     3
4      5    10     1     4
5      6    12     1     5
6      7    14     1     6
7      8    16     1     7
8      9    18     1     8
9     10    20     1     9
10    11    22     1    10
11    12    24     1    11
12    13    26     1    12
13    14    28     1    13
14    15    30     1    14

In [109]:
indice = dataframe1.index

In [110]:
indice

Int64Index([0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14], dtype='int64')

In [111]:
indice.values

array([ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14])

In [112]:
2 in indice

True

In [113]:
20 in indice

False

In [114]:
20 in dataframe1.index

False

In [294]:
dataframe1.columns = ["Columna1","Columna2","Columna3","Columna4"]

In [295]:
dataframe1

    Columna1  Columna2  Columna3  Columna4
0          1         2         1         0
1          2         4         1         1
2          3         6         1         2
3          4         8         1         3
4          5        10         1         4
5          6        12         1         5
6          7        14         1         6
7          8        16         1         7
8          9        18         1         8
9         10        20         1         9
10        11        22         1        10
11        12        24         1        11
12        13        26         1        12
13        14        28         1        13
14        15        30         1        14

In [121]:
dataframe1.columns = ["c1","c2","c3","c4","c5"]

ValueError: Length mismatch: Expected axis has 4 elements, new values have 5 elements

In [296]:
dataframe1.reindex(columns=["Columna1","c2","c3","c4","c5"])

    Columna1  c2  c3  c4  c5
0          1 NaN NaN NaN NaN
1          2 NaN NaN NaN NaN
2          3 NaN NaN NaN NaN
3          4 NaN NaN NaN NaN
4          5 NaN NaN NaN NaN
5          6 NaN NaN NaN NaN
6          7 NaN NaN NaN NaN
7          8 NaN NaN NaN NaN
8          9 NaN NaN NaN NaN
9         10 NaN NaN NaN NaN
10        11 NaN NaN NaN NaN
11        12 NaN NaN NaN NaN
12        13 NaN NaN NaN NaN
13        14 NaN NaN NaN NaN
14        15 NaN NaN NaN NaN

In [297]:
dataframe1

    Columna1  Columna2  Columna3  Columna4
0          1         2         1         0
1          2         4         1         1
2          3         6         1         2
3          4         8         1         3
4          5        10         1         4
5          6        12         1         5
6          7        14         1         6
7          8        16         1         7
8          9        18         1         8
9         10        20         1         9
10        11        22         1        10
11        12        24         1        11
12        13        26         1        12
13        14        28         1        13
14        15        30         1        14

In [298]:
dataframe1.reindex([2,3,4,20,22,23])

    Columna1  Columna2  Columna3  Columna4
2          3         6         1         2
3          4         8         1         3
4          5        10         1         4
20       NaN       NaN       NaN       NaN
22       NaN       NaN       NaN       NaN
23       NaN       NaN       NaN       NaN

In [299]:
df1 = pd.concat([dataframe1,dataframe1])

In [300]:
df1

    Columna1  Columna2  Columna3  Columna4
0          1         2         1         0
1          2         4         1         1
2          3         6         1         2
3          4         8         1         3
4          5        10         1         4
5          6        12         1         5
6          7        14         1         6
7          8        16         1         7
8          9        18         1         8
9         10        20         1         9
10        11        22         1        10
11        12        24         1        11
12        13        26         1        12
13        14        28         1        13
14        15        30         1        14
0          1         2         1         0
1          2         4         1         1
2          3         6         1         2
3          4         8         1         3
4          5        10         1         4
5          6        12         1         5
6          7        14         1         6
7          8        16         1         7
8          9        18         1         8
9         10        20         1         9
10        11        22         1        10
11        12        24         1        11
12        13        26         1        12
13        14        28         1        13
14        15        30         1        14

In [301]:
df1['Columna1'][14]

14    15
14    15
Name: Columna1, dtype: int64

In [303]:
df1.set_index(np.arange(len(df1)))

    Columna1  Columna2  Columna3  Columna4
0          1         2         1         0
1          2         4         1         1
2          3         6         1         2
3          4         8         1         3
4          5        10         1         4
5          6        12         1         5
6          7        14         1         6
7          8        16         1         7
8          9        18         1         8
9         10        20         1         9
10        11        22         1        10
11        12        24         1        11
12        13        26         1        12
13        14        28         1        13
14        15        30         1        14
15         1         2         1         0
16         2         4         1         1
17         3         6         1         2
18         4         8         1         3
19         5        10         1         4
20         6        12         1         5
21         7        14         1         6
22         8        16         1         7
23         9        18         1         8
24        10        20         1         9
25        11        22         1        10
26        12        24         1        11
27        13        26         1        12
28        14        28         1        13
29        15        30         1        14

In [130]:
dataframeconvacios = dataframe1.reindex(columns=['Columna1','c2','c3'])

In [131]:
dataframeconvacios

    Columna1  c2  c3
0          1 NaN NaN
1          2 NaN NaN
2          3 NaN NaN
3          4 NaN NaN
4          5 NaN NaN
5          6 NaN NaN
6          7 NaN NaN
7          8 NaN NaN
8          9 NaN NaN
9         10 NaN NaN
10        11 NaN NaN
11        12 NaN NaN
12        13 NaN NaN
13        14 NaN NaN
14        15 NaN NaN

In [132]:
dataframeconvacios.dropna()

Empty DataFrame
Columns: [Columna1, c2, c3]
Index: []

In [133]:
dataframeconvacios.fillna(1)

    Columna1  c2  c3
0          1   1   1
1          2   1   1
2          3   1   1
3          4   1   1
4          5   1   1
5          6   1   1
6          7   1   1
7          8   1   1
8          9   1   1
9         10   1   1
10        11   1   1
11        12   1   1
12        13   1   1
13        14   1   1
14        15   1   1

In [134]:
dataframe1["Columna2"][1]

4

In [137]:
dataframe1.ix[1]

Columna1    2
Columna2    4
Columna3    1
Columna4    1
Name: 1, dtype: int64

In [138]:
dataframe1.ix[1]["Columna2"]

4

In [139]:
serie1 = dataframe1["Columna2"]

In [140]:
serie1

0      2
1      4
2      6
3      8
4     10
5     12
6     14
7     16
8     18
9     20
10    22
11    24
12    26
13    28
14    30
Name: Columna2, dtype: int64

In [141]:
serie1 > 10

0     False
1     False
2     False
3     False
4     False
5      True
6      True
7      True
8      True
9      True
10     True
11     True
12     True
13     True
14     True
Name: Columna2, dtype: bool

In [142]:
dataframe1["Columna2"]>10

0     False
1     False
2     False
3     False
4     False
5      True
6      True
7      True
8      True
9      True
10     True
11     True
12     True
13     True
14     True
Name: Columna2, dtype: bool

In [143]:
dataframe1[dataframe1["Columna2"]>10]

    Columna1  Columna2  Columna3  Columna4
5          6        12         1         5
6          7        14         1         6
7          8        16         1         7
8          9        18         1         8
9         10        20         1         9
10        11        22         1        10
11        12        24         1        11
12        13        26         1        12
13        14        28         1        13
14        15        30         1        14

In [148]:
condicion = (dataframe1["Columna2"] > 10) & (dataframe1["Columna4"] > 8)

In [150]:
condicion

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9      True
10     True
11     True
12     True
13     True
14     True
dtype: bool

In [149]:
dataframe1[condicion]

    Columna1  Columna2  Columna3  Columna4
9         10        20         1         9
10        11        22         1        10
11        12        24         1        11
12        13        26         1        12
13        14        28         1        13
14        15        30         1        14

# Apply

In [152]:
def suma(val):
    return val+1

In [153]:
suma(3)

4

In [155]:
dataframe1

    Columna1  Columna2  Columna3  Columna4
0          1         2         1         0
1          2         4         1         1
2          3         6         1         2
3          4         8         1         3
4          5        10         1         4
5          6        12         1         5
6          7        14         1         6
7          8        16         1         7
8          9        18         1         8
9         10        20         1         9
10        11        22         1        10
11        12        24         1        11
12        13        26         1        12
13        14        28         1        13
14        15        30         1        14

In [154]:
dataframe1.applymap(suma)

    Columna1  Columna2  Columna3  Columna4
0          2         3         2         1
1          3         5         2         2
2          4         7         2         3
3          5         9         2         4
4          6        11         2         5
5          7        13         2         6
6          8        15         2         7
7          9        17         2         8
8         10        19         2         9
9         11        21         2        10
10        12        23         2        11
11        13        25         2        12
12        14        27         2        13
13        15        29         2        14
14        16        31         2        15

In [157]:
dataframe1.applymap(lambda element : 2*element +1)

    Columna1  Columna2  Columna3  Columna4
0          3         5         3         1
1          5         9         3         3
2          7        13         3         5
3          9        17         3         7
4         11        21         3         9
5         13        25         3        11
6         15        29         3        13
7         17        33         3        15
8         19        37         3        17
9         21        41         3        19
10        23        45         3        21
11        25        49         3        23
12        27        53         3        25
13        29        57         3        27
14        31        61         3        29

In [158]:
dataframe1.apply(lambda serie : 2*serie)

    Columna1  Columna2  Columna3  Columna4
0          2         4         2         0
1          4         8         2         2
2          6        12         2         4
3          8        16         2         6
4         10        20         2         8
5         12        24         2        10
6         14        28         2        12
7         16        32         2        14
8         18        36         2        16
9         20        40         2        18
10        22        44         2        20
11        24        48         2        22
12        26        52         2        24
13        28        56         2        26
14        30        60         2        28

In [159]:
dataframe1.apply(lambda serie : serie.min())

Columna1    1
Columna2    2
Columna3    1
Columna4    0
dtype: int64

In [160]:
dataframe1.apply(lambda serie : serie.max())

Columna1    15
Columna2    30
Columna3     1
Columna4    14
dtype: int64

In [162]:
dataframe1.apply(lambda serie : serie.max(),axis=1)

0      2
1      4
2      6
3      8
4     10
5     12
6     14
7     16
8     18
9     20
10    22
11    24
12    26
13    28
14    30
dtype: int64

In [163]:
dataframe1.apply(lambda serie : Series([serie.min(),serie.max()]))

   Columna1  Columna2  Columna3  Columna4
0         1         2         1         0
1        15        30         1        14

In [166]:
dataframe1.apply(lambda serie : Series([serie[0],serie[1]]))

   Columna1  Columna2  Columna3  Columna4
0         1         2         1         0
1         2         4         1         1

In [170]:
def ask(row):
    return row["capacity"]*row["km"]

In [168]:
paxdata = DataFrame({
        'vuelo':["AF101","AF102"],
        'capacity':[70,100],
        'km':[10000,1000]
    })

In [171]:
paxdata.apply(ask,axis=1)

0    700000
1    100000
dtype: int64

In [172]:
paxdata["ask"]=paxdata.apply(ask,axis=1)

In [173]:
paxdata

   capacity     km  vuelo     ask
0        70  10000  AF101  700000
1       100   1000  AF102  100000

# Loading and saving data

In [176]:
import pandas as pd
from pandas import Series,DataFrame

In [177]:
!ls

Pandas Getting Started.ipynb

In [178]:
!ls /

bin   dev  home  lib64	     media  opt   root	sbin  sys  usr
boot  etc  lib	 lost+found  mnt    proc  run	srv   tmp  var

In [179]:
!pwd

/home/dsc/Repositories/Master_Data_Science_Repo/Pandas

In [180]:
dataframe4 = pd.read_csv("/home/dsc/Data/opentraveldata/optd_aircraft.csv")

In [182]:
dataframe4

    iata_code^manufacturer^model^iata_group^iata_category^icao_code^nb_engines^aircraft_type
0                       100^Fokker^100^100^2J^F100^2^J
1                      141^BAe^146-100^146^4J^B461^4^J
2    142^BAe^BAE Systems 146-200 Passenger^146^4J^B...
3                      143^BAe^146-300^146^4J^B463^4^J
4                                     146^BAe^146^^^^^
5     14F^BAe^146 Freighter (-100/200/300QT & QC)^^^^^
6    14X^BAe^146 Freighter (-100QT & QC)^14F^4J^B46...
7    14Y^BAe^146 Freighter (-200QT & QC)^14F^4J^B46...
8    14Z^BAe^146 Freighter (-300QT & QC)^14F^4J^B46...
9                                 19D^Airbus^A319^^^^^
10                                310^Airbus^A310^^^^^
11                 312^Airbus^A310-200^310^2J^A310^2^J
12                 313^Airbus^A310-300^310^2J^A310^2^J
13                     318^Airbus^A318^32S^2J^A318^2^J
14                     319^Airbus^A319^32S^2J^A319^2^J
15                               31F^Airbus^A310F^^^^^
16                    31W^Airbus^A319 (Sharklets)^^^^^
17                31X^Airbus^A310-200F^31F^2J^A310^2^J
18                31Y^Airbus^A310-300F^31F^2J^A310^2^J
19             320^Airbus^A320-100/200^32S^2J^A320^2^J
20             321^Airbus^A321-100/200^32S^2J^A321^2^J
21         32A^Airbus^A320 (sharklets)^32S^2J^A320^2^J
22         32B^Airbus^A321 (sharklets)^32S^2J^A321^2^J
23                    32C^Airbus^A318 (sharklets)^^^^^
24                    32D^Airbus^A319 (sharklets)^^^^^
25           32F^Airbus^A320 Freighter^32F^2J^A320^2^J
26           32X^Airbus^A321 Freighter^32X^2J^A321^2^J
27                                330^Airbus^A330^^^^^
28                 332^Airbus^A330-200^330^2J^A332^2^J
29                 333^Airbus^A330-300^330^2J^A333^2^J
..                                                 ...
427                     S76^Sikorsky^S-76^S76^H^S76^^H
428                  SF3^Saab^SF340A/B^SF3^2T^SF34^2^T
429                    SFB^Saab^SF340B^SF3^2T^SF34^2^T
430           SFF^Saab^SF340 Freighter^SFF^2T^SF34^2^T
431                  SH3^Shorts^SD.330^SH3^2T^SH33^2^T
432                  SH6^Shorts^SD.360^SH6^2T^SH36^2^T
433                       SHB^Shorts^SC-5 Belfast^^^^^
434              SHS^Shorts^SC-7 Skyvan^SHS^2T^SC7^2^T
435             SSC^Aerospatiale / SNIAS^Concorde^^^^^
436                       SU1^Sukhoi^Superjet 100^^^^^
437         SU7^Sukhoi^Superjet 100-75^SU1^2J^ZZZZ^2^J
438         SU9^Sukhoi^Superjet 100-95^SU1^2J^SU95^2^J
439  SWF^Fairchild-Swearingen^SA226 Freighter^SWF^2...
440  SWM^Fairchild-Swearingen^SA26 / SA226 / SA227 ...
441                    SY8^Shaanxi^Y-8^SY8^4T^AN12^4^T
442        T20^Tupolev^Tu-204 / Tu-214^T20^2J^T204^2^J
443       T2F^Tupolev^Tu-204 Freighter^T2F^2J^T204^2^J
444                 T34^Tupolev^Tu-334^T34^2J^T334^2^J
445           TBM^DAHER-SOCATA^TBM-700^TBM^1T^TBM7^1^T
446          TRN^Surface Equipment^Train^TRN^S^0000^^S
447                 TU3^Tupolev^Tu-134^TU3^2J^T134^2^J
448                 TU5^Tupolev^Tu-154^TU5^3J^T154^3^J
449                          VCV^Vickers^Viscount^^^^^
450                             VCX^Vickers^VC-10^^^^^
451              WWP^IAI^1124 Westwind^WWP^2J^WW24^2^J
452     YK2^Yakovlev / Jakovlev^Yak 42^YK2^3J^YK42^3^J
453     YK4^Yakovlev / Jakovlev^Yak 40^YK4^3J^YK40^3^J
454               YN2^HAMC / Harbin^Y12^YN2^2T^Y12^2^T
455               YN7^Xian^Yunshuji Y7^YN7^2T^AN24^2^T
456                     YS1^NAMC^YS-11^YS1^2T^YS11^2^T

[457 rows x 1 columns]

In [183]:
dataframe4.head()

  iata_code^manufacturer^model^iata_group^iata_category^icao_code^nb_engines^aircraft_type
0                     100^Fokker^100^100^2J^F100^2^J
1                    141^BAe^146-100^146^4J^B461^4^J
2  142^BAe^BAE Systems 146-200 Passenger^146^4J^B...
3                    143^BAe^146-300^146^4J^B463^4^J
4                                   146^BAe^146^^^^^

In [184]:
aircraftdf = pd.read_csv("/home/dsc/Data/opentraveldata/optd_aircraft.csv",sep="^")

In [185]:
aircraftdf.head()

,iata_code,manufacturer,model,iata_group,iata_category,icao_code,nb_engines,aircraft_type
0,100,Fokker,100,100,2J,F100,2,J
1,141,BAe,146-100,146,4J,B461,4,J
2,142,BAe,BAE Systems 146-200 Passenger,146,4J,B462,4,J
3,143,BAe,146-300,146,4J,B463,4,J
4,146,BAe,146,NaN,NaN,NaN,NaN,NaN

In [187]:
len(aircraftdf)

457

In [188]:
aircraftdf.describe()

       nb_engines
count  343.000000
mean     2.408163
std      0.842679
min      1.000000
25%      2.000000
50%      2.000000
75%      3.000000
max      6.000000

In [192]:
aircraftdf.index

Int64Index([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,
            ...
            447, 448, 449, 450, 451, 452, 453, 454, 455, 456],
           dtype='int64', length=457)

In [193]:
aircraftdf.columns

Index([u'iata_code', u'manufacturer', u'model', u'iata_group',
       u'iata_category', u'icao_code', u'nb_engines', u'aircraft_type'],
      dtype='object')

In [194]:
aircraftdf.sort("manufacturer")

,iata_code,manufacturer,model,iata_group,iata_category,icao_code,nb_engines,aircraft_type
173,AT4,ATR,ATR 42-300 / 320,ATR,2T,AT43,2,T
174,AT5,ATR,ATR 42-500,ATR,2T,AT45,2,T
175,AT7,ATR,ATR 72,ATR,2T,AT72,2,T
176,ATD,ATR,ATR 42-400,ATR,2T,AT44,2,T
177,ATF,ATR,ATR 72 Freighter,ATF,2T,AT72,2,T
179,ATR,ATR,ATR 42 / ATR 72,NaN,NaN,NaN,NaN,NaN
180,ATZ,ATR,ATR 42 Freighter,ATZ,2T,*,2,T
411,NDC,Aerospatiale / SNIAS,SN.601 Corvette,NDC,2J,S601,2,J
435,SSC,Aerospatiale / SNIAS,Concorde,NaN,NaN,NaN,NaN,NaN
159,AGH,Agusta / AgustaWestland,A-109,AGH,H,A109,NaN,H
181,AWH,AgustaWestland,AW139,AWH,2T,A139,2,T
9,19D,Airbus,A319,NaN,NaN,NaN,NaN,NaN
10,310,Airbus,A310,NaN,NaN,NaN,NaN,NaN
11,312,Airbus,A310-200,310,2J,A310,2,J
12,313,Airbus,A310-300,310,2J,A310,2,J
13,318,Airbus,A318,32S,2J,A318,2,J
14,319,Airbus,A319,32S,2J,A319,2,J
15,31F,Airbus,A310F,NaN,NaN,NaN,NaN,NaN
16,31W,Airbus,A319 (Sharklets),NaN,NaN,NaN,NaN,NaN
17,31X,Airbus,A310-200F,31F,2J,A310,2,J
18,31Y,Airbus,A310-300F,31F,2J,A310,2,J
19,320,Airbus,A320-100/200,32S,2J,A320,2,J
20,321,Airbus,A321-100/200,32S,2J,A321,2,J
21,32A,Airbus,A320 (sharklets),32S,2J,A320,2,J
22,32B,Airbus,A321 (sharklets),32S,2J,A321,2,J
23,32C,Airbus,A318 (sharklets),NaN,NaN,NaN,NaN,NaN
24,32D,Airbus,A319 (sharklets),NaN,NaN,NaN,NaN,NaN
25,32F,Airbus,A320 Freighter,32F,2J,A320,2,J
26,32X,Airbus,A321 Freighter,32X,2J,A321,2,J
27,330,Airbus,A330,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...
431,SH3,Shorts,SD.330,SH3,2T,SH33,2,T
432,SH6,Shorts,SD.360,SH6,2T,SH36,2,T
433,SHB,Shorts,SC-5 Belfast,NaN,NaN,NaN,NaN,NaN
434,SHS,Shorts,SC-7 Skyvan,SHS,2T,SC7,2,T
425,S58,Sikorsky,S-58T,S58,H,S58T,NaN,H
426,S61,Sikorsky,S-61,S61,H,S61,NaN,H
427,S76,Sikorsky,S-76,S76,H,S76,NaN,H
233,CRV,Sud-Est,SE.210 Caravelle,NaN,NaN,NaN,NaN,NaN
436,SU1,Sukhoi,Superjet 100,NaN,NaN,NaN,NaN,NaN
437,SU7,Sukhoi,Superjet 100-75,SU1,2J,ZZZZ,2,J
438,SU9,Sukhoi,Superjet 100-95,SU1,2J,SU95,2,J
202,BUS,Surface Equipment,Bus,BUS,S,0000,NaN,S
383,LCH,Surface Equipment,Launch/Boat,LCH,S,0000,NaN,S
385,LMO,Surface Equipment,Limousine,LMO,S,0000,NaN,S
446,TRN,Surface Equipment,Train,TRN,S,0000,NaN,S
442,T20,Tupolev,Tu-204 / Tu-214,T20,2J,T204,2,J
443,T2F,Tupolev,Tu-204 Freighter,T2F,2J,T204,2,J
444,T34,Tupolev,Tu-334,T34,2J,T334,2,J
447,TU3,Tupolev,Tu-134,TU3,2J,T134,2,J
448,TU5,Tupolev,Tu-154,TU5,3J,T154,3,J
449,VCV,Vickers,Viscount,NaN,NaN,NaN,NaN,NaN
450,VCX,Vickers,VC-10,NaN,NaN,NaN,NaN,NaN
405,MA6,Xian,MA-60,MA6,2T,AN24,2,T
455,YN7,Xian,Yunshuji Y7,YN7,2T,AN24,2,T
452,YK2,Yakovlev / Jakovlev,Yak 42,YK2,3J,YK42,3,J
453,YK4,Yakovlev / Jakovlev,Yak 40,YK4,3J,YK40,3,J
201,BTA,NaN,Business Turbo-Prop Aircraft,BTA,2T,ZZZZ,2,T
358,HOV,NaN,Surface Equipment-Hovercraft,HOV,S,0000,NaN,S
384,LJA,NaN,Light Jet Aircraft,LJA,2J,ZZZZ,2,J
423,RFS,NaN,Surface Equipment-Road Feeder Service (Truck),RFS,S,0000,NaN,S

In [195]:
aircraftdf.sort("nb_engines",ascending=False)

,iata_code,manufacturer,model,iata_group,iata_category,icao_code,nb_engines,aircraft_type
145,A5F,Antonov,An-225,A5F,6J,A225,6,J
89,742,Boeing,747-200,747,4J,B742,4,J
106,74V,Boeing,747SR Freighter,74F,4J,B74R,4,J
94,74C,Boeing,747-200 Combi,74M,4J,B742,4,J
368,IL8,Ilyushin,IL-18,IL8,4T,IL18,4,T
369,IL9,Ilyushin,IL-96,IL9,4J,IL96,4,J
370,ILW,Ilyushin,IL-86,ILW,4J,IL86,4,J
302,DH7,De Havilland Canada,DHC-7 Dash 7,DH7,4T,DHC7,4,T
274,D8X,Douglas,DC-8-61 / 62 / 63 Freighter,D8F,4J,DC86,4,J
275,D8Y,Douglas,DC-8-71 / 72 / 73 Freighter,D8F,4J,DC87,4,J
386,LOE,Lockheed,L-188 Electra,LOE,4T,L188,4,T
1,141,BAe,146-100,146,4J,B461,4,J
387,LOF,Lockheed,L-188 Electra Freighter,LOF,4T,L188,4,T
388,LOH,Lockheed,L-182 / 282 / 382 (L-100) Hercules,LOH,4T,C130,4,T
108,74Y,Boeing,747-400 Freighter,74F,4J,B744,4,J
107,74X,Boeing,747-200 Freighter,74F,4J,B742,4,J
105,74U,Boeing,747-300 / 747-200 SUD Freighter,74F,4J,B743,4,J
46,70F,Boeing,707 Freighter,70F,4J,B703,4,J
287,DC4,Douglas,DC-4,DC4,4P,DC4,4,P
288,DC6,Douglas,DC6A/B,DC6,4P,DC6,4,P
104,74T,Boeing,747-100 Freighter,74F,4J,B741,4,J
103,74R,Boeing,747SR,747,4J,B74R,4,J
102,74N,Boeing,747-8F,74F,4J,B748,4,J
100,74L,Boeing,747SP,747,4J,B74S,4,J
99,74J,Boeing,747-400 (Domestic),747,4J,B74D,4,J
98,74H,Boeing,747-8i,747,4J,B748,4,J
96,74E,Boeing,747-400 Combi,74M,4J,B744,4,J
88,741,Boeing,747-100,747,4J,B741,4,J
95,74D,Boeing,747-300 Combi,74M,4J,B743,4,J
90,743,Boeing,747-300,747,4J,B743,4,J
...,...,...,...,...,...,...,...,...
358,HOV,NaN,Surface Equipment-Hovercraft,HOV,S,0000,NaN,S
361,I93,Ilyushin,IL-96-300,NaN,NaN,NaN,NaN,NaN
363,I9M,Ilyushin,IL-96M,NaN,NaN,NaN,NaN,NaN
364,I9X,Ilyushin,IL-96-300 Freighter,NaN,NaN,NaN,NaN,NaN
365,I9Y,Ilyushin,IL-96T Freighter,NaN,NaN,NaN,NaN,NaN
374,JST,BAe,Jetstream 31 / 32 / 41,NaN,NaN,NaN,NaN,NaN
376,L10,Lockheed,L-1011 Tristar,NaN,NaN,NaN,NaN,NaN
380,L49,Lockheed,L-1049 Super Constellation,NaN,NaN,NaN,NaN,NaN
383,LCH,Surface Equipment,Launch/Boat,LCH,S,0000,NaN,S
385,LMO,Surface Equipment,Limousine,LMO,S,0000,NaN,S
389,LOM,Lockheed,L-188 Electra Mixed,NaN,NaN,NaN,NaN,NaN
396,M80,McDonnell Douglas,MD-80,NaN,NaN,NaN,NaN,NaN
404,M95,McDonnell Douglas,MD-95,NaN,NaN,NaN,NaN,NaN
406,MBH,MBB,Bo 105,MBH,H,B105,NaN,H
407,MD9,MD Helicopters,MD900 Explorer,MD9,H,EXPL,NaN,H
408,MIH,Mil,Mi-8 / Mi-17 / Mi-171 / Mil-172,MIH,H,MI8,NaN,H
410,ND2,Nord / SNCAN,N.262,NaN,NaN,NaN,NaN,NaN
412,NDE,Eurocopter,AS350 Ecureuil / AS355 Ecureuil 2,NDE,H,*,NaN,H
413,NDH,Eurocopter,SA365C / SA365N Dauphin 2,NDH,H,*,NaN,H
417,PAG,Piper,Piper light aircraft,NaN,NaN,NaN,NaN,NaN
423,RFS,NaN,Surface Equipment-Road Feeder Service (Truck),RFS,S,0000,NaN,S
425,S58,Sikorsky,S-58T,S58,H,S58T,NaN,H
426,S61,Sikorsky,S-61,S61,H,S61,NaN,H
427,S76,Sikorsky,S-76,S76,H,S76,NaN,H
433,SHB,Shorts,SC-5 Belfast,NaN,NaN,NaN,NaN,NaN
435,SSC,Aerospatiale / SNIAS,Concorde,NaN,NaN,NaN,NaN,NaN
436,SU1,Sukhoi,Superjet 100,NaN,NaN,NaN,NaN,NaN
446,TRN,Surface Equipment,Train,TRN,S,0000,NaN,S
449,VCV,Vickers,Viscount,NaN,NaN,NaN,NaN,NaN
450,VCX,Vickers,VC-10,NaN,NaN,NaN,NaN,NaN

In [196]:
aircraftdf.sort("nb_engines",ascending=False).head(5)

,iata_code,manufacturer,model,iata_group,iata_category,icao_code,nb_engines,aircraft_type
145,A5F,Antonov,An-225,A5F,6J,A225,6,J
89,742,Boeing,747-200,747,4J,B742,4,J
106,74V,Boeing,747SR Freighter,74F,4J,B74R,4,J
94,74C,Boeing,747-200 Combi,74M,4J,B742,4,J
368,IL8,Ilyushin,IL-18,IL8,4T,IL18,4,T

In [197]:
aircraftdf.rank()

,iata_code,manufacturer,model,iata_group,iata_category,icao_code,nb_engines,aircraft_type
0,1,336.5,2.0,2.0,92.5,254.0,134,128.0
1,2,89.0,9.0,4.0,307.0,94.5,312,128.0
2,3,89.0,201.0,4.0,307.0,96.5,312,128.0
3,4,89.0,10.0,4.0,307.0,98.5,312,128.0
4,5,89.0,4.0,NaN,NaN,NaN,NaN,NaN
5,6,89.0,5.0,NaN,NaN,NaN,NaN,NaN
6,7,89.0,6.0,7.0,307.0,94.5,312,128.0
7,8,89.0,7.0,7.0,307.0,96.5,312,128.0
8,9,89.0,8.0,7.0,307.0,98.5,312,128.0
9,10,33.5,142.5,NaN,NaN,NaN,NaN,NaN
10,11,33.5,134.0,NaN,NaN,NaN,NaN,NaN
11,12,33.5,135.0,9.5,92.5,49.5,134,128.0
12,13,33.5,137.0,9.5,92.5,49.5,134,128.0
13,14,33.5,140.0,16.5,92.5,52.0,134,128.0
14,15,33.5,142.5,16.5,92.5,53.0,134,128.0
15,16,33.5,139.0,NaN,NaN,NaN,NaN,NaN
16,17,33.5,144.0,NaN,NaN,NaN,NaN,NaN
17,18,33.5,136.0,11.5,92.5,49.5,134,128.0
18,19,33.5,138.0,11.5,92.5,49.5,134,128.0
19,20,33.5,148.0,16.5,92.5,55.0,134,128.0
20,21,33.5,151.0,16.5,92.5,58.0,134,128.0
21,22,33.5,146.0,16.5,92.5,55.0,134,128.0
22,23,33.5,149.0,16.5,92.5,58.0,134,128.0
23,24,33.5,141.0,NaN,NaN,NaN,NaN,NaN
24,25,33.5,145.0,NaN,NaN,NaN,NaN,NaN
25,26,33.5,147.0,13.0,92.5,55.0,134,128.0
26,27,33.5,150.0,20.0,92.5,58.0,134,128.0
27,28,33.5,152.0,NaN,NaN,NaN,NaN,NaN
28,29,33.5,154.0,21.5,92.5,60.5,134,128.0
29,30,33.5,156.0,21.5,92.5,62.0,134,128.0
...,...,...,...,...,...,...,...,...
427,428,433.0,423.0,339.0,350.5,331.0,NaN,6.5
428,429,424.5,434.0,340.5,221.5,335.0,134,321.0
429,430,424.5,435.0,340.5,221.5,335.0,134,321.0
430,431,424.5,433.0,342.0,221.5,335.0,134,321.0
431,432,429.5,430.0,343.0,221.5,337.0,134,321.0
432,433,429.5,431.0,344.0,221.5,338.0,134,321.0
433,434,429.5,428.0,NaN,NaN,NaN,NaN,NaN
434,435,429.5,429.0,345.0,221.5,333.0,134,321.0
435,436,8.5,248.0,NaN,NaN,NaN,NaN,NaN
436,437,437.0,437.0,NaN,NaN,NaN,NaN,NaN
437,438,437.0,438.0,346.5,92.5,357.5,134,128.0
438,439,437.0,439.0,346.5,92.5,339.0,134,128.0
439,440,330.5,424.0,348.0,221.5,15.0,134,321.0
440,441,330.5,425.0,349.0,221.5,15.0,134,321.0
441,442,427.0,452.0,350.0,339.5,72.5,312,321.0
442,443,445.0,446.0,351.0,92.5,342.5,134,128.0
443,444,445.0,447.0,352.0,92.5,342.5,134,128.0
444,445,445.0,448.0,353.0,92.5,344.0,134,128.0
445,446,247.0,442.0,354.0,11.5,345.0,7,321.0
446,447,440.5,443.0,355.0,359.5,33.0,NaN,276.5
447,448,445.0,444.0,356.0,92.5,340.0,134,128.0
448,449,445.0,445.0,357.0,268.0,341.0,268,128.0
449,450,448.5,451.0,NaN,NaN,NaN,NaN,NaN
450,451,448.5,450.0,NaN,NaN,NaN,NaN,NaN
451,452,360.0,3.0,358.0,92.5,347.0,134,128.0
452,453,452.5,456.0,359.0,268.0,350.0,268,128.0
453,454,452.5,455.0,360.0,268.0,349.0,268,128.0
454,455,351.0,453.0,361.0,221.5,348.0,134,321.0
455,456,450.5,457.0,362.0,221.5,76.0,134,321.0
456,457,410.0,454.0,363.0,221.5,351.0,134,321.0

In [200]:
aircraftdf.sum()

nb_engines    826
dtype: float64

In [201]:
aircraftdf.describe()

       nb_engines
count  343.000000
mean     2.408163
std      0.842679
min      1.000000
25%      2.000000
50%      2.000000
75%      3.000000
max      6.000000

In [202]:
aircraftdf.head()

,iata_code,manufacturer,model,iata_group,iata_category,icao_code,nb_engines,aircraft_type
0,100,Fokker,100,100,2J,F100,2,J
1,141,BAe,146-100,146,4J,B461,4,J
2,142,BAe,BAE Systems 146-200 Passenger,146,4J,B462,4,J
3,143,BAe,146-300,146,4J,B463,4,J
4,146,BAe,146,NaN,NaN,NaN,NaN,NaN

In [203]:
aircraftdf.to_csv("salida.csv")

In [204]:
!ls

Pandas Getting Started.ipynb  salida.csv

In [205]:
!ls -l

total 276
-rw-rw-r--. 1 dsc dsc 256569 dic 11 21:31 Pandas Getting Started.ipynb
-rw-rw-r--. 1 dsc dsc  21017 dic 11 21:30 salida.csv

In [207]:
aircraftdf.to_excel("salida.xls")

In [208]:
minidf = aircraftdf.head()

In [209]:
minidf

,iata_code,manufacturer,model,iata_group,iata_category,icao_code,nb_engines,aircraft_type
0,100,Fokker,100,100,2J,F100,2,J
1,141,BAe,146-100,146,4J,B461,4,J
2,142,BAe,BAE Systems 146-200 Passenger,146,4J,B462,4,J
3,143,BAe,146-300,146,4J,B463,4,J
4,146,BAe,146,NaN,NaN,NaN,NaN,NaN

In [210]:
minidf.to_dict()

{'aircraft_type': {0: 'J', 1: 'J', 2: 'J', 3: 'J', 4: nan},
 'iata_category': {0: '2J', 1: '4J', 2: '4J', 3: '4J', 4: nan},
 'iata_code': {0: '100', 1: '141', 2: '142', 3: '143', 4: '146'},
 'iata_group': {0: '100', 1: '146', 2: '146', 3: '146', 4: nan},
 'icao_code': {0: 'F100', 1: 'B461', 2: 'B462', 3: 'B463', 4: nan},
 'manufacturer': {0: 'Fokker', 1: 'BAe', 2: 'BAe', 3: 'BAe', 4: 'BAe'},
 'model': {0: '100',
  1: '146-100',
  2: 'BAE Systems 146-200 Passenger',
  3: '146-300',
  4: '146'},
 'nb_engines': {0: 2.0, 1: 4.0, 2: 4.0, 3: 4.0, 4: nan}}

### Pasar a formato json

In [211]:
minidf.to_dict(orient="record")

[{'aircraft_type': 'J',
  'iata_category': '2J',
  'iata_code': '100',
  'iata_group': '100',
  'icao_code': 'F100',
  'manufacturer': 'Fokker',
  'model': '100',
  'nb_engines': 2.0},
 {'aircraft_type': 'J',
  'iata_category': '4J',
  'iata_code': '141',
  'iata_group': '146',
  'icao_code': 'B461',
  'manufacturer': 'BAe',
  'model': '146-100',
  'nb_engines': 4.0},
 {'aircraft_type': 'J',
  'iata_category': '4J',
  'iata_code': '142',
  'iata_group': '146',
  'icao_code': 'B462',
  'manufacturer': 'BAe',
  'model': 'BAE Systems 146-200 Passenger',
  'nb_engines': 4.0},
 {'aircraft_type': 'J',
  'iata_category': '4J',
  'iata_code': '143',
  'iata_group': '146',
  'icao_code': 'B463',
  'manufacturer': 'BAe',
  'model': '146-300',
  'nb_engines': 4.0},
 {'aircraft_type': nan,
  'iata_category': nan,
  'iata_code': '146',
  'iata_group': nan,
  'icao_code': nan,
  'manufacturer': 'BAe',
  'model': '146',
  'nb_engines': nan}]

In [214]:
fileoutput = open("fichero.json","w")

In [215]:
fileoutput.write(minidf.to_json(orient="records"))

In [216]:
fileoutput.close()

In [217]:
!ls

fichero.json  Pandas Getting Started.ipynb  salida.csv	salida.xls

In [218]:
aircraftdf2 = pd.read_excel("salida.xls")

In [219]:
aircraftdf2.head()

,iata_code,manufacturer,model,iata_group,iata_category,icao_code,nb_engines,aircraft_type
0,100,Fokker,100,100,2J,F100,2,J
1,141,BAe,146-100,146,4J,B461,4,J
2,142,BAe,BAE Systems 146-200 Passenger,146,4J,B462,4,J
3,143,BAe,146-300,146,4J,B463,4,J
4,146,BAe,146,NaN,NaN,NaN,NaN,NaN

# Fake Data Creation

In [220]:
range(0,10)

[0, 1, 2, 3, 4, 5, 6, 7, 8, 9]

In [233]:
fake = DataFrame({'Col1':range(0,100)})

In [223]:
fake.head()

   Col1
0     0
1     1
2     2
3     3
4     4

In [254]:
random = DataFrame(np.random.rand(1000,1))

In [237]:
random.head()

          0
0  0.678639
1  0.996849
2  0.597969
3  0.851530
4  0.194637

In [255]:
random.columns=['Population']

In [240]:
random.head()

   Population
0    0.678639
1    0.996849
2    0.597969
3    0.851530
4    0.194637

In [244]:
len(random)

1000

In [256]:
random.apply(lambda row: int(abs(100*row[0])),axis=1)

0      87
1       0
2      65
3      54
4       6
5      50
6      98
7      61
8      60
9       3
10     72
11     22
12     27
13     99
14     35
15     40
16     89
17     69
18      1
19     20
20     48
21     70
22     89
23     70
24      0
25     17
26     93
27     67
28     37
29     43
       ..
970     3
971    46
972    59
973     6
974    20
975    94
976    31
977    52
978    33
979    65
980    37
981    11
982    16
983    24
984    18
985    66
986    56
987    57
988    39
989    23
990    91
991    20
992     8
993    82
994    76
995     8
996    39
997    14
998     7
999    67
dtype: int64

In [257]:
random['Population']= random.apply(lambda row: int(abs(100*row[0])),axis=1)

In [258]:
random.head()

   Population
0          87
1           0
2          65
3          54
4           6